app/controllers/school_classes_controller.rb

  def show
    @school_classes = SchoolClasses.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @school_class = SchoolClasses.new
    @school_class.title = params[:title]
    @school_class.description = params[:description]
    @school_class.save
---
INSERT INTO "school_classes" DEFAULT VALUES

  def edit
    @school_classes = SchoolClasses.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]