app/controllers/students_controller.rb

  def create
    @student = Students.new
    @student.first_name = params[:first_name]
    @student.last_name = params[:last_name]
    @student.save
---
SELECT  "students".* FROM "students" ORDER BY "students"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-14 18:56:07.038980"], ["updated_at", "2019-04-14 18:56:07.038980"]]

  def edit
    @students = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]